const array = [
    'я в Симбирск,',
    'в трактире.',
    'с утра',
    'В ту же ночь',
    'Я остановился',
    'для закупки', 
    'что и было поручено Савельичу.',
    'приехал,',
    'где должен был',
    'нужных вещей',
    'отправился по лавкам',
    'пробыть сутки',
    'Савельич'
]
    array[0] = 'В ту же ночь ',
    array[1] = 'приехал, ',
    array[2] = 'я в Симбирск, ',
    array[3] = 'где должен был ',
    array[4] = 'пробыть сутки ',
    array[5] = 'для закупки ',
    array[6] = 'нужных вещей ',
    array[7] = 'что и было поручено Савельичу. ',
    array[8] = 'Я остановился ',
    array[9] = 'в трактире. ',
    array[10] = 'Савельич ',
    array[11] = 'с утра ',
    array[12] = 'отправился по лавкам'
let result = array[0] + array[1] + array[2] + array[3] + array[4] + array[5] + array[6] + array[7] + array[8] + array[9] + array[10] + array[11] + array[12];

console.log(result);